Revit 2025 API
ShowHiddenLinesValues Enumeration
 Provides options for display of hidden lines in a given view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum ShowHiddenLinesValues
Public Enumeration ShowHiddenLinesValues
public enum class ShowHiddenLinesValues
type ShowHiddenLinesValues
Members
Member name | Value | Description
None | 0 |  Do not show any hidden lines.
ByDiscipline | 1 |  Show hidden lines according to discipline.
All | 2 |  Show all hidden lines.
See Also
Reference
Autodesk.Revit.DB Namespace